In [18]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [19]:
# use dictionary 
names = {1: 'Farah', 2: 'Noura', 3: 'Hasan'}
s = pd.Series(names)
s

1    Farah
2    Noura
3    Hasan
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [20]:
s.index = [11, 12, 13]
s

11    Farah
12    Noura
13    Hasan
dtype: object

## Q3: Retrieve First and second elements.

In [21]:
s[0:2]

11    Farah
12    Noura
dtype: object

In [22]:
s.loc[11:12]

11    Farah
12    Noura
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [23]:
s2 = pd.Series({14: 'Farah'})
s = s.append(s2)
s

11    Farah
12    Noura
13    Hasan
14    Farah
dtype: object

In [25]:
s = s.drop_duplicates()
s

11    Farah
12    Noura
13    Hasan
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [26]:
Students = pd.DataFrame(columns=["ID", "Name", "GPA"])
Students

Empty DataFrame
Columns: [ID, Name, GPA]
Index: []

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [31]:

data = pd.read_csv(r"\Users\asus\Desktop\labs\Lectures\6-pandas\educ_figdp_1_Data.csv")
data

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [40]:
data[0:10]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e

In [41]:
data.loc[0:10]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
5,2005,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
6,2006,European Union (28 countries),Total public expenditure on education as % of ...,4.91,e
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
8,2008,European Union (28 countries),Total public expenditure on education as % of ...,5.04,e
9,2009,European Union (28 countries),Total public expenditure on education as % of ...,5.38,e
10,2010,European Union (28 countries),Total public expenditure on education as % of ...,5.41,e

## Q7: Give an example shows the difference between loc and slicing?

### The slicing does not include the last record in the range 
### The loc shows the records including the last record in the range